{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: replacing road scene images with videos, configuring video autoplay/loop, applying darkening filter for night effect, and preserving click-to-advance behavior.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the RV journey experience with video backgrounds, checkpoint system, audio integration, and interactive UI components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, defining design tokens for the application's color palette.",
  "frontend/index.html": "HTML entry point for the React application with title describing an interactive RV driver-view website with 3 checkpoints.",
  "frontend/src/App.tsx": "Root React component that renders the RVExperience component within a full-height container.",
  "frontend/src/components/rv/ActionPlayback.tsx": "Empty file placeholder for action playback component (content truncated or not yet implemented).",
  "frontend/src/components/rv/AnimatedTravelFallback.tsx": "Empty file placeholder for animated travel fallback component (content truncated or not yet implemented).",
  "frontend/src/components/rv/BreakStopReachedOverlay.tsx": "Modal overlay component that displays when reaching a break stop, featuring sound effects, animated RV icon, and continue button.",
  "frontend/src/components/rv/CampfireEndScreen.tsx": "Celebration screen shown after reaching checkpoint 1 with campfire background image, badge earned notification, and continue button with sound effects.",
  "frontend/src/components/rv/CheckpointOverlay.tsx": "Empty file placeholder for checkpoint overlay component (content truncated or not yet implemented).",
  "frontend/src/components/rv/checkpoints.ts": "Defines checkpoint data structures and exports three checkpoints (Rest Stop, Scenic Overlook, Campground) with various water-consuming actions like brewing coffee, washing dishes, and showering.",
  "frontend/src/components/rv/ClickToContinueHint.tsx": "Empty file placeholder for click-to-continue hint component (content truncated or not yet implemented).",
  "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx": "Interactive quiz overlay presenting multiple-choice options to diagnose RV system failure (water tank empty), with visual effects, sound feedback, and answer validation logic.",
  "frontend/src/components/rv/ProgressIndicator.tsx": "Displays a progress bar and status indicator for the RV journey, showing current state (traveling, break stop, halted, etc.) and progress through checkpoints with visual badges.",
  "frontend/src/components/rv/RVBadgeCelebration.tsx": "Shows a celebration overlay when the RV badge is earned, with animations, sound effects, and a button to continue to the destination.",
  "frontend/src/components/rv/RVExperience.tsx": "Main orchestrator component for the RV journey experience, managing flow state transitions, auto-advancing through states, playing background audio, and rendering appropriate scenes based on current journey state.",
  "frontend/src/components/rv/scenes.ts": "Defines scene data structures and exports four driving scenes (morning, sunset, evening, night) with background images and videos, plus two special scenes for halt issues and campfire destination.",
  "frontend/src/components/rv/StartJourneyScreen.tsx": "Initial screen for the RV journey with journey overview, instructions about limited visibility, and a start button that triggers sound effects.",
  "frontend/src/components/rv/TravelScene.tsx": "Renders a static image-based travel scene with background image, title, description, gradient overlays, and optional click interaction with hint text.",
  "frontend/src/components/rv/TravelTransition.tsx": "Displays a loading transition screen between journey segments with animated spinner, status message, and sound effects.",
  "frontend/src/components/rv/TravelVideoScene.tsx": "Renders a video-based travel scene with autoplay looping video, fallback to static image on error, optional darkening overlay, and click interaction support.",
  "frontend/src/components/rv/TripComplete.tsx": "Displays a completion screen with journey summary, badge earned, and restart button; plays a completion sound effect on mount and includes a footer with attribution link.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useRVFlow.ts": "Custom hook managing RV journey flow state machine with transitions between start, traveling, break stops, halt issues, celebration, destination, and completion states.",
  "frontend/src/hooks/useSfx.ts": "Custom hook for managing audio playback with configurable volume and loop options, providing play/stop controls and ready/error state tracking.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm desert/road-trip color palette using CSS variables for light and dark modes, plus text shadow utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, box shadows, and keyframe animations for accordions and fades.",
  "project_state.json": "Project state tracking file documenting completed features for replacing road scene background images with looping autoplay videos, applying darkening filters for night effects, and preserving click-to-advance behavior."
}