{
  "backend/main.mo": "Empty Motoko actor with no logic defined.",
  "feature_evidence.json": "Feature evidence report listing two user-interaction changes and the frontend files involved.",
  "frontend-file-summaries.txt": "Existing summaries of key frontend files generated by a prior process.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "HTML shell that loads the React application into a root container.",
  "frontend/src/App.tsx": "Wraps and renders the RVExperience component as the main app view.",
  "frontend/src/components/rv/ActionPlayback.tsx": "Empty component placeholder with no implementation.",
  "frontend/src/components/rv/AnimatedTravelFallback.tsx": "Crossfading image animation component providing a motion fallback when video playback fails.",
  "frontend/src/components/rv/BreakStopReachedOverlay.tsx": "Overlay screen shown when reaching a break stop, playing sound and offering a continue button.",
  "frontend/src/components/rv/CampfireEndScreen.tsx": "Campfire arrival overlay with celebration visuals and a continue action.",
  "frontend/src/components/rv/CheckpointOverlay.tsx": "Empty component placeholder with no implementation.",
  "frontend/src/components/rv/checkpoints.ts": "Defines checkpoint and action data structures and exports three preset checkpoints with their actions.",
  "frontend/src/components/rv/ClickToContinueHint.tsx": "Full‑screen clickable overlay prompting the user to continue.",
  "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx": "Failure-state overlay with animated indicators and a multiple‑choice quiz gating progression.",
  "frontend/src/components/rv/ProgressIndicator.tsx": "Displays journey status, break stop count, and progress bar based on the current flow state.",
  "frontend/src/components/rv/RVBadgeCelebration.tsx": "Shows a celebratory badge UI with animations and a button to proceed after earning the RV badge.",
  "frontend/src/components/rv/RVExperience.tsx": "Controls the overall RV journey flow, rendering scenes based on flow state and managing audio, transitions, and user actions.",
  "frontend/src/components/rv/scenes.ts": "Defines scene metadata and exports several preset travel scenes plus special halt and destination scenes.",
  "frontend/src/components/rv/StartJourneyScreen.tsx": "Start screen presenting journey overview and a button to begin the RV adventure.",
  "frontend/src/components/rv/TravelScene.tsx": "Displays a static travel scene with a background image, title, and description overlay.",
  "frontend/src/components/rv/TravelTransition.tsx": "Shows an animated loading-style transition screen between travel segments or before destination arrival.",
  "frontend/src/components/rv/TravelVideoScene.tsx": "Plays a travel video with fallback logic, monitoring stalls and triggering callbacks for timing or user advancement.",
  "frontend/src/components/rv/TripComplete.tsx": "Final screen summarizing the trip and offering an option to restart the journey.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useRVFlow.ts": "Implements state machine hooks for the RV journey flow, including traveling, break stops, issues, and completion.",
  "frontend/src/hooks/useSfx.ts": "Custom hook for playing and stopping sound effects using an HTMLAudioElement.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining a warm road‑trip color palette and dark mode variants.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and container settings using CSS variables.",
  "project_state.json": "Describes current project state, known issues, and feature requirements for RV Journey development."
}