{
  "backend/main.mo": "Defines an empty Motoko actor with no logic.",
  "feature_evidence.json": "Lists feature-evidence metadata describing click-to-advance updates and affected frontend files.",
  "frontend-file-summaries.txt": "Includes prewritten summaries of all major frontend components, hooks, and scenes.",
  "frontend/index.css": "Tailwind base and theme variable definitions establishing OKLCH color palettes and global styling.",
  "frontend/index.html": "Base HTML shell loading the React app into the root element.",
  "frontend/src/App.tsx": "Root React component that renders the RVExperience inside a full-height container.",
  "frontend/src/components/rv/ActionPlayback.tsx": "Stepper-style UI that walks users through selected checkpoint actions and advances when complete.",
  "frontend/src/components/rv/AnimatedTravelFallback.tsx": "Crossfading Ken Burns–animated image loop used when travel video cannot play.",
  "frontend/src/components/rv/CheckpointOverlay.tsx": "Overlay modal letting users choose exactly two activities per checkpoint with selection validation.",
  "frontend/src/components/rv/checkpoints.ts": "Defines checkpoint metadata and available actions with labels, icons, and consumption values. Provides structured data for all three journey checkpoints.",
  "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx": "Overlay shown after checkpoint 3 delay that displays an issue alert and resolve button.",
  "frontend/src/components/rv/ProgressIndicator.tsx": "Displays journey status, checkpoint count, and progress bar based on flow state conditions. Computes status text, progress percentage, and current checkpoint dynamically.",
  "frontend/src/components/rv/RVExperience.tsx": "Main coordinator for the RV flow, rendering different scenes and overlays depending on flow state. Handles transitions, timers, and user interactions to advance the journey.",
  "frontend/src/components/rv/scenes.ts": "Defines SceneData and provides preset scene objects for travel segments, halt issue, and destination.",
  "frontend/src/components/rv/StartJourneyScreen.tsx": "Renders the intro screen with journey description and a button to begin. Provides a visually styled start card with feature highlights.",
  "frontend/src/components/rv/TravelScene.tsx": "Shows a static travel scene with background image and descriptive text. Overlays gradients and text for readability.",
  "frontend/src/components/rv/TravelTransition.tsx": "Displays a loading-style transition screen between checkpoints or before destination. Shows animated loader and context-specific messages.",
  "frontend/src/components/rv/TravelVideoScene.tsx": "Handles video playback for travel segments, with fallbacks for stalls or playback failures. Manages timing, autoplay issues, and triggers advancement callbacks.",
  "frontend/src/components/rv/TripComplete.tsx": "Shows final completion screen with trip summary and restart button. Includes year footer and external link attribution.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the user's Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading, login, logout, and status management using Dfinity AuthClient.",
  "frontend/src/hooks/useRVFlow.ts": "Manages the full RV journey state machine including traveling, checkpoints with action selection, playback, halt issue, and destination flow.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines a warm desert-themed color system with dark mode variants.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrapped around the main App component.",
  "frontend/tailwind.config.js": "Extends Tailwind with custom colors, shadows, animations, and container settings using CSS variables.",
  "project_state.json": "Describes the project’s current state, requirements, issues, and architecture for a Flutter web RV journey app."
}