{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text map providing short descriptions of all frontend RV-experience-related components and utilities.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens, dark mode values, and global styling utilities.",
  "frontend/index.html": "Base HTML shell loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Root React component rendering the RVExperience full-screen.",
  "frontend/src/components/rv/ActionPlayback.tsx": "Displays sequential playback of selected checkpoint actions with progress indicators and a continue button.",
  "frontend/src/components/rv/CheckpointOverlay.tsx": "Modal for choosing 1–2 checkpoint activities with selection limits and action toggling.",
  "frontend/src/components/rv/checkpoints.ts": "Defines checkpoint metadata including IDs, titles, and available actions with consumption values.",
  "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx": "Overlay shown during the forced halt issue with system-check hints and an 'Issue resolved' button.",
  "frontend/src/components/rv/ProgressIndicator.tsx": "Top-bar indicator showing journey state, checkpoint progress, and halt alerts based on flow state.",
  "frontend/src/components/rv/RVExperience.tsx": "Main controller component that renders different RV journey scenes based on flow state and triggers auto-advances using effects.",
  "frontend/src/components/rv/scenes.ts": "Provides scene metadata plus special scenes for halt issues and final destination.",
  "frontend/src/components/rv/StartJourneyScreen.tsx": "Landing screen with journey intro details and a button to start the RV experience.",
  "frontend/src/components/rv/TravelScene.tsx": "Displays a static scenic background with title and description overlay.",
  "frontend/src/components/rv/TravelTransition.tsx": "Shows a transition screen between checkpoints with loading animation and status text.",
  "frontend/src/components/rv/TravelVideoScene.tsx": "Loops a travel video or fallback image, tracks elapsed time, and triggers callback after a duration.",
  "frontend/src/components/rv/TripComplete.tsx": "End-of-journey summary screen with trip stats and restart button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking. Wraps Dfinity AuthClient with custom options and exposes identity state to the app.",
  "frontend/src/hooks/useRVFlow.ts": "Implements a state machine for the RV journey flow, handling traveling, checkpoints, action selection, playback, issue halt, destination, and completion. Tracks internal resource consumption and provides helper transitions.",
  "frontend/src/index.css": "Defines Tailwind base/theme layers with custom warm-color variables, dark mode values, and text-shadow utilities. Applies global styling and sets up the app’s visual theme.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering. Imports global styles and mounts the App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors mapped to CSS variables, extended theme utilities, animations, shadows, and plugins. Enables class-based dark mode and sets content paths.",
  "project_state.json": "Stores project metadata describing a Flutter web app’s RV journey flow, resource mechanic, required images, and known issues. Acts as a centralized state and requirement definition file."
}