{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend for the ICP canister.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: single break stop flow, traveling sound effect, break point arrival sound, system alert sound, and campfire arrival sound, each mapped to specific frontend files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing an RV journey experience with single break stop, water-themed activities, sound effects, and various overlays including halt issue quiz and campfire celebration.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining a warm desert/road-trip color palette.",
  "frontend/index.html": "HTML entry point with root div and module script reference, titled 'Interactive RV Driver-View Website with 3 Checkpoints and Action Choices'.",
  "frontend/src/App.tsx": "Root React component that renders the RVExperience component within a full-height container.",
  "frontend/src/components/rv/ActionPlayback.tsx": "Empty file placeholder for action playback component (no implementation present).",
  "frontend/src/components/rv/AnimatedTravelFallback.tsx": "Component that crossfades through four scene images with Ken Burns pan/zoom effects as a fallback when video playback fails.",
  "frontend/src/components/rv/BreakStopReachedOverlay.tsx": "Modal overlay announcing break stop arrival with MapPin badge, RV emoji animation, and continue button, playing break-point-reached.mp3 sound effect on mount.",
  "frontend/src/components/rv/CampfireEndScreen.tsx": "Celebration overlay for reaching the campfire destination with flame animations, RV badge award message, and campfire-arrival.mp3 sound effect.",
  "frontend/src/components/rv/CheckpointOverlay.tsx": "Empty file placeholder for checkpoint overlay component (no implementation present).",
  "frontend/src/components/rv/checkpoints.ts": "Defines TypeScript interfaces and data for three checkpoint stops (Rest Stop, Scenic Overlook, Campground) with actions that have water consumption values.",
  "frontend/src/components/rv/ClickToContinueHint.tsx": "Full-screen clickable overlay with pulsing button displaying customizable continue message and chevron icon.",
  "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx": "Dramatic failure overlay with animated visual indicators (drips, warning lights) and multiple-choice quiz to identify 'Resource tank empty' as the correct issue, playing thud, alert, and issue sound effects with inline feedback for wrong answers.",
  "frontend/src/components/rv/ProgressIndicator.tsx": "Displays a fixed-position progress bar and status indicator showing the current journey state, progress percentage, and break stop count with appropriate icons and styling based on flow state.",
  "frontend/src/components/rv/RVBadgeCelebration.tsx": "Shows a celebratory overlay when the RV badge is earned, featuring animated award icon, congratulations message, and a button to continue to the destination.",
  "frontend/src/components/rv/RVExperience.tsx": "Main orchestrator component that manages the RV journey flow state machine, renders appropriate scenes based on current state, handles auto-advancement logic, and controls sound effects for traveling and campfire arrival.",
  "frontend/src/components/rv/scenes.ts": "Exports scene data arrays with background images and descriptions for four journey scenes, plus special scenes for halt-issue and campfire destination.",
  "frontend/src/components/rv/StartJourneyScreen.tsx": "Initial screen displaying journey overview with RV emoji, trip details (1 break stop), instructions about limited visibility, and a start button to begin the adventure.",
  "frontend/src/components/rv/TravelScene.tsx": "Renders a static scene with a background image, gradient overlay, and bottom-left positioned title and description text with backdrop blur styling.",
  "frontend/src/components/rv/TravelTransition.tsx": "Displays a loading transition screen with spinner and animated dots when moving between break stops or arriving at the destination.",
  "frontend/src/components/rv/TravelVideoScene.tsx": "Plays a looping travel video with health monitoring (stall detection, playback timeout), automatically falls back to animated scene if video fails, and triggers callbacks on timer completion or user click.",
  "frontend/src/components/rv/TripComplete.tsx": "Final completion screen showing journey summary statistics, a restart button, and footer with caffeine.ai attribution and copyright notice.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login, logout, and identity management using DFINITY AuthClient.",
  "frontend/src/hooks/useRVFlow.ts": "Custom hook managing RV journey flow state machine with transitions between start, traveling, break-stop, halt-issue, celebration, and destination states.",
  "frontend/src/hooks/useSfx.ts": "React hook for managing HTML5 audio playback with configurable volume and loop options, providing play and stop controls.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm desert/road-trip color palette using OKLCH color space, plus text shadow utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom colors (using OKLCH), shadows, animations, and keyframes for accordion, fade, and slide effects.",
  "project_state.json": "Project metadata tracking journey flow architecture with single breakpoint, system alert on user click, and audio enhancements at key journey moments."
}