{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend for the ICP application.",
  "feature_evidence.json": "Feature evidence report documenting five features related to UI improvements, audio additions, and flow changes in the RV journey experience components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing the RV journey experience with single break stop, water-themed activities, and interactive driver-view scenes.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, including warm desert/road-trip palette and custom border/shadow utilities.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tags and a title describing an interactive RV driver-view website with 3 checkpoints.",
  "frontend/src/App.tsx": "Root React component that renders the RVExperience component within a full-height container.",
  "frontend/src/components/rv/ActionPlayback.tsx": "Empty file placeholder for action playback component (content truncated or not yet implemented).",
  "frontend/src/components/rv/AnimatedTravelFallback.tsx": "Component that crossfades through four scene images with Ken Burns animations every 20 seconds as a fallback when video cannot play.",
  "frontend/src/components/rv/BreakStopReachedOverlay.tsx": "Modal overlay announcing arrival at a break stop with badge, RV icon animation, and continue button, playing a sound effect on mount.",
  "frontend/src/components/rv/CampfireEndScreen.tsx": "Celebratory overlay shown upon reaching the campfire destination, displaying RV badge earned message with flame animations and campfire arrival sound effect.",
  "frontend/src/components/rv/CheckpointOverlay.tsx": "Empty file placeholder for checkpoint overlay component (content truncated or not yet implemented).",
  "frontend/src/components/rv/checkpoints.ts": "Defines checkpoint data structures and exports three checkpoints (Rest Stop, Scenic Overlook, Campground) with various actions that consume different amounts of water resources.",
  "frontend/src/components/rv/ClickToContinueHint.tsx": "Full-screen clickable overlay with a pulsing continue button that plays ambient sound effect when clicked to advance the journey.",
  "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx": "Dramatic failure overlay with animated visual indicators and a multiple-choice quiz to identify the correct issue (water tank empty), playing multiple sound effects and providing inline feedback for wrong answers.",
  "frontend/src/components/rv/ProgressIndicator.tsx": "Displays a progress bar and status indicator for the RV journey, showing current state (traveling, break stop, halted, etc.) with visual badges and progress percentage based on flow state.",
  "frontend/src/components/rv/RVBadgeCelebration.tsx": "Shows a celebration overlay when the RV badge is earned, with animated award icon and a button to continue to the destination, playing a celebration sound effect on mount.",
  "frontend/src/components/rv/RVExperience.tsx": "Main orchestrator component for the RV journey experience that manages flow state transitions, renders appropriate scenes (start, traveling, break stops, halt issues, destination), and handles audio effects. Includes auto-advance logic for certain states and guards against duplicate triggers.",
  "frontend/src/components/rv/scenes.ts": "Exports scene data arrays for different RV journey backgrounds (morning, sunset, rain, night) plus special scenes for halt issues and campfire destinations.",
  "frontend/src/components/rv/StartJourneyScreen.tsx": "Initial screen that introduces the RV journey adventure with overview details (1 break stop, driver perspective, limited visibility) and a start button that plays ambient sound when clicked.",
  "frontend/src/components/rv/TravelScene.tsx": "Renders a static travel scene with a background image, gradient overlay, and bottom-left info card displaying the scene title and description.",
  "frontend/src/components/rv/TravelTransition.tsx": "Displays a loading transition screen between journey segments with a spinner, status message indicating whether continuing or arriving at destination, and plays transition sound effect.",
  "frontend/src/components/rv/TravelVideoScene.tsx": "Manages video playback for traveling segments with health monitoring (stall detection, playback timeout), automatically falling back to AnimatedTravelFallback if video fails to play or stalls repeatedly. Handles timer-based or user-triggered advancement.",
  "frontend/src/components/rv/TripComplete.tsx": "React component displaying a journey completion screen with summary stats, a restart button, and a footer with attribution to caffeine.ai. Plays a campfire arrival sound effect on mount.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor using Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validity checks.",
  "frontend/src/hooks/useRVFlow.ts": "Custom hook managing the RV journey flow state machine with transitions between start, traveling, break stops, halt issues, celebration, destination, and completion states.",
  "frontend/src/hooks/useSfx.ts": "React hook for managing HTML5 audio playback with configurable volume and loop options, providing play and stop controls.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm desert/road-trip color palette using OKLCH color space, plus text shadow utilities and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (using OKLCH), border radius variables, warm shadows, and custom animations for accordions, fades, and slides.",
  "project_state.json": "Project state tracking five feature requests related to fixing duplicate text, adjusting road image transition timing to 20 seconds, adding comprehensive audio effects, and restoring road scenes with click-anywhere interaction after breakpoint and issue overlays."
}