{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend for the ICP canister.",
  "feature_evidence.json": "Feature evidence report documenting five high-confidence features related to the two-video journey flow, campfire destination screen, and state machine updates with associated test IDs and file references.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend component files describing the RV journey flow, UI components, hooks, and scene definitions for the two-video interactive experience.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining the warm desert/road-trip color palette.",
  "frontend/index.html": "HTML entry point for the React application with title describing an interactive RV driver-view website with 3 checkpoints and action choices.",
  "frontend/src/App.tsx": "Root React component that renders the RVExperience component within a full-height container.",
  "frontend/src/components/rv/ActionPlayback.tsx": "Empty file placeholder for action playback component (content truncated or not yet implemented).",
  "frontend/src/components/rv/AnimatedTravelFallback.tsx": "Empty file placeholder for animated travel fallback component (content truncated or not yet implemented).",
  "frontend/src/components/rv/BreakStopReachedOverlay.tsx": "Modal overlay component that displays when reaching a break stop, featuring an animated RV icon, sound effects, and a continue button.",
  "frontend/src/components/rv/CampfireEndScreen.tsx": "Final destination celebration screen displaying the campfire background image, RV badge earned message, and continue button with sound effects.",
  "frontend/src/components/rv/CheckpointOverlay.tsx": "Empty file placeholder for checkpoint overlay component (content truncated or not yet implemented).",
  "frontend/src/components/rv/checkpoints.ts": "Defines checkpoint data structures (ActionItem, CheckpointData) and exports three checkpoints (Rest Stop, Scenic Overlook, Campground) with various water-consuming actions and their consumption values.",
  "frontend/src/components/rv/ClickToContinueHint.tsx": "Empty file placeholder for click-to-continue hint component (content truncated or not yet implemented).",
  "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx": "Interactive quiz overlay presenting five answer options (fuel, food, tire, water, battery) with visual feedback, sound effects, and correct answer validation for the water tank issue.",
  "frontend/src/components/rv/ProgressIndicator.tsx": "Top-bar progress indicator showing journey status with progress bar and percentage, mapping flow states to progress values from 0% (start) to 100% (complete).",
  "frontend/src/components/rv/RVBadgeCelebration.tsx": "Displays a celebration overlay when the user earns an RV badge, featuring animations, sound effects, and a button to proceed to the destination.",
  "frontend/src/components/rv/RVExperience.tsx": "Main orchestrator component for the RV journey experience that manages flow state, renders different scenes (start, travel videos, rest points, issues, completion), and handles background audio and scene transitions.",
  "frontend/src/components/rv/scenes.ts": "Defines SceneData interface and exports five scene configurations for the RV journey: two video scenes (morning and continuing journey), and three static image scenes (halt issue, night road, campfire destination).",
  "frontend/src/components/rv/StartJourneyScreen.tsx": "Initial screen that introduces the RV journey adventure with overview details, instructions, and a start button that triggers sound effects.",
  "frontend/src/components/rv/TravelScene.tsx": "Renders a static travel scene with a background image, title, description, and optional click interactivity with hint text.",
  "frontend/src/components/rv/TravelTransition.tsx": "Displays a loading transition screen between journey segments with animated spinner, checkpoint messaging, and sound effects.",
  "frontend/src/components/rv/TravelVideoScene.tsx": "Renders a travel scene with video background that falls back to static image on error, supporting click interactivity and optional darkening overlay.",
  "frontend/src/components/rv/TripComplete.tsx": "Final completion screen showing journey summary, badge earned status, restart button, and footer with attribution link to caffeine.ai.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useRVFlow.ts": "Custom hook managing RV journey flow state machine with eight states (start, traveling videos, rest point, halt issue, night road, destination, complete) and transition functions between them.",
  "frontend/src/hooks/useSfx.ts": "React hook for managing sound effects with HTMLAudioElement, providing play/stop controls, loading state tracking, error handling, and configurable volume/loop options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm desert/road-trip color palette using OKLCH color space, defining CSS variables for light/dark themes and utility classes for text shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH-based color system, container settings, border radius variables, warm-themed shadows, and custom animations for accordions, fades, and slides.",
  "project_state.json": "Project state tracking an interactive RV journey app with two-video structure, rest points, issue resolution, night road sequence, and campfire celebration ending. Contains existing features and pending feature requests for flow restructuring."
}