{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Metadata file describing a feature request and associated evidence, targeting StartJourneyScreen.tsx.",
  "frontend-file-summaries.txt": "Text index summarizing frontend components and their roles in the RV experience flow.",
  "frontend/index.css": "Tailwind base/theme variables and light/dark OKLCH color system definitions.",
  "frontend/index.html": "HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component rendering the RVExperience inside a full-height container.",
  "frontend/src/components/rv/ActionPlayback.tsx": "Sequential activity playback screen showing each selected action with progress and completion handling.",
  "frontend/src/components/rv/AnimatedTravelFallback.tsx": "Crossfading Ken Burns–style animated background fallback rotating through four scene images.",
  "frontend/src/components/rv/CampfireEndScreen.tsx": "Campfire celebration screen awarding an RV badge and offering a continue button.",
  "frontend/src/components/rv/CheckpointOverlay.tsx": "Overlay for selecting one or more checkpoint activities with validation and action toggling.",
  "frontend/src/components/rv/checkpoints.ts": "Defines checkpoint data with titles and actions, exporting a list of three RV trip checkpoints and their consumptions.",
  "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx": "Overlay displaying an RV issue alert with checklist and a resolve action.",
  "frontend/src/components/rv/ProgressIndicator.tsx": "Displays journey status, checkpoint count, and progress bar based on the current flow state.",
  "frontend/src/components/rv/RVBadgeCelebration.tsx": "Shows a celebration overlay when a badge is earned and provides a button to proceed.",
  "frontend/src/components/rv/RVExperience.tsx": "Coordinates the full RV journey flow, rendering different screens based on flow state and managing timed transitions.",
  "frontend/src/components/rv/scenes.ts": "Provides scene metadata for RV journey backgrounds plus special halt and destination scenes.",
  "frontend/src/components/rv/StartJourneyScreen.tsx": "Initial welcome screen introducing the RV trip and offering a button to start the journey.",
  "frontend/src/components/rv/TravelScene.tsx": "Renders a static scenic background with title and description for checkpoint scenes.",
  "frontend/src/components/rv/TravelTransition.tsx": "Displays a loading-style transition screen when leaving a checkpoint or approaching the final destination.",
  "frontend/src/components/rv/TravelVideoScene.tsx": "Plays a video for travel segments with fallback logic if playback stalls and triggers checkpoint advancement when appropriate.",
  "frontend/src/components/rv/TripComplete.tsx": "End-of-journey screen summarizing trip stats and offering a restart option.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context/provider handling auth client setup, login, logout, and identity state.",
  "frontend/src/hooks/useRVFlow.ts": "Manages RV journey state transitions, user actions at checkpoints, and resource consumption tracking.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light/dark themes with desert-inspired colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin usage for the project.",
  "project_state.json": "Defines the project’s current Flutter web app state, including flow requirements for a 3‑stop journey, architectural notes, and known issues. Captures features, constraints, and behavior updates for travel, break stops, activities, and final campfire flow."
}