{
  "kind": "build_request",
  "title": "Fix missing travel video, update water-themed checkpoint activities, and add post-checkpoint-3 halt + campfire destination",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Fix the missing traveling video/scenery during travel segments so that users always see either (a) the RV front-view traveling video or (b) a reliable visual fallback if the video cannot be loaded/played.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "While traveling the video or scenery is missing."
        ]
      },
      "acceptanceCriteria": [
        "When the flow state is traveling, the UI renders visible scenery (video or fallback) instead of a blank/black/missing background.",
        "If the video asset at \"/assets/rv-travel-front-view.mp4\" is missing or fails to play, the app displays a non-empty fallback travel view (e.g., a static scene background) without breaking timed checkpoint progression.",
        "Timed checkpoint triggering still occurs after ~60 seconds of continuous traveling state per segment."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Update the checkpoint activity options so the actions are mostly water-related tasks (e.g., cooking, cleaning, freshen up, grab coffee/tea, refreshments), while keeping the existing 1–2 selection rule and the hidden internal consumption mechanic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The activities should mostly include things with water like cooking cleaning, freshen up, grab coffee/tea, refreshments etc."
        ]
      },
      "acceptanceCriteria": [
        "Each checkpoint presents 3–4 actions and the majority of them match the requested water-related theme (cooking/cleaning/freshen up/coffee or tea/refreshments).",
        "The UI copy does not explicitly mention water, hydration, or water consumption as the reason for any effects (the hidden consumption remains internal/subtle).",
        "Users can select either 1 or 2 activities (no more than 2) before continuing, as currently enforced."
      ]
    },
    {
      "id": "REQ-14",
      "text": "After the user completes the 3rd checkpoint’s action playback, force the journey to come to a halt due to an unidentified issue; present a user action labeled \"Issue resolved\" and only resume the journey after the user clicks it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "after the 3rd checkpoint the journey has to come to a halt  dues to some unidentified issue. after clicking on issue resolved only the journey has to continue"
        ]
      },
      "acceptanceCriteria": [
        "After completing checkpoint 3 playback, the app does not immediately show the normal trip completion screen; instead it enters a distinct halt/issue state.",
        "In the halt/issue state, the UI displays a clear message indicating an unidentified issue and a button labeled exactly \"Issue resolved\".",
        "The journey resumes only after the user clicks \"Issue resolved\" (no automatic continuation)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "After the user clicks \"Issue resolved\", continue the journey to a final destination scene where there is a campfire, and then show the end-of-journey completion UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...only the journey has to continue and reach a destination where there will be a campfire."
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Issue resolved\" transitions back into traveling and then reaches a final destination scene that visually depicts a campfire.",
        "The destination scene uses a dedicated static background image under frontend/public/assets/generated (not served by the backend).",
        "After reaching the campfire destination scene, the app shows the journey completion UI (or equivalent end state) and still supports restarting the journey."
      ]
    }
  ],
  "constraints": [
    "Frontend must not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not introduce any user-facing text that explicitly mentions water/hydration/water consumption as a mechanic."
  ],
  "nonGoals": [
    "Adding third-party video hosting/streaming or external media services.",
    "Adding real-time features (WebSockets/chat/notifications).",
    "Implementing non-Internet-Identity auth providers."
  ],
  "imageRequirements": {
    "required": [
      "Campfire destination scene background, nighttime campsite with visible campfire glow (rv-destination-campfire.dim_1920x1080.png)",
      "Unidentified issue halt scene background, roadside stop with hazard/alert mood but no explicit text (rv-journey-halt-issue.dim_1920x1080.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}