{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace road scene images with autoplay videos and add night drive effect",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace all road scene background images with uploaded video files for the four journey segments",
      "acceptanceCriteria": [
        "All four road journey segments in scenes.ts reference uploaded video files instead of static images",
        "Video sources are properly configured in the scene data structure",
        "No static road background images remain in the scene definitions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/rv/scenes.ts",
          "operation": "modify",
          "description": "Replace the videoSrc values for roadScenes array entries (morning, sunset, evening, night) with paths to the uploaded video files. Map morning segment to mixkit-traveling-on-the-highway-on-a-sunny-day-42368-hd-ready.mp4, sunset to mixkit-52453-video-52453-hd-ready.mp4, evening to mixkit-52427-video-52427-hd-ready.mp4, and night to an appropriate darkened video. Update the backgroundImage fallback paths if needed to match the video theme."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Configure road scene videos to loop continuously and autoplay when displayed",
      "acceptanceCriteria": [
        "Videos start playing automatically when the scene is rendered",
        "Videos loop seamlessly without user interaction",
        "Autoplay works across all road journey segments"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/rv/TravelVideoScene.tsx",
          "operation": "modify",
          "description": "Add autoPlay and loop attributes to the video element to enable continuous looping playback. Ensure muted attribute is present to allow autoplay to work across browsers. Verify these attributes work with the existing video error handling and fallback logic."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply darkening filter to one road scene video to create night drive effect",
      "acceptanceCriteria": [
        "One road scene video has a darkening overlay or filter applied",
        "The darkened video is positioned appropriately in the journey progression",
        "The darkening effect creates a convincing night drive atmosphere"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/rv/TravelVideoScene.tsx",
          "operation": "modify",
          "description": "Add conditional rendering logic to apply a dark overlay (using absolute positioned div with semi-transparent black background or CSS filter) when the scene is identified as the night segment. Use scene title or index to determine which video should receive the darkening effect. The overlay should be positioned above the video but below the text content overlay."
        },
        {
          "path": "frontend/src/components/rv/scenes.ts",
          "operation": "modify",
          "description": "Add an optional property to the RoadScene type definition to mark which scene should have the night drive darkening effect applied. Set this flag on the appropriate scene entry (likely the evening or night segment based on story progression) to enable the darkening filter in TravelVideoScene."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Preserve existing click behavior on road scene videos for journey advancement",
      "acceptanceCriteria": [
        "Clicking on any road scene video triggers the same advancement logic as before",
        "Click hint overlay remains visible and functional",
        "Video playback does not interfere with click event handling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/rv/TravelVideoScene.tsx",
          "operation": "modify",
          "description": "Verify that the existing onClick handler on the container div continues to work with video elements. Ensure the video element does not have pointer-events that would block clicks, or add pointer-events-none class to the video if needed. Confirm ClickToContinueHint remains visible and the click interaction advances the journey as expected."
        }
      ]
    }
  ]
}