{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify to single breakpoint and add journey sound effects",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Reduce journey flow to include only one break stop instead of multiple checkpoints",
      "acceptanceCriteria": [
        "Journey includes exactly one break stop",
        "Existing BreakStopReachedOverlay component is reused for the single break",
        "Flow progression remains: traveling → break stop → user click → alert → continue → campfire"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useRVFlow.ts",
          "operation": "modify",
          "description": "Update the flow state machine to support exactly one break stop instead of multiple checkpoints. Modify the checkpoint tracking logic to ensure only a single break occurs during the journey, maintaining the traveling → break stop → continue → alert → campfire sequence."
        },
        {
          "path": "frontend/src/components/rv/ProgressIndicator.tsx",
          "operation": "modify",
          "description": "Update progress display logic to reflect the single break stop model. Adjust break stop count display and progress calculations to show 1 total break instead of multiple checkpoints."
        },
        {
          "path": "frontend/src/components/rv/RVExperience.tsx",
          "operation": "modify",
          "description": "Update journey flow orchestration to use only one break stop. Ensure the component renders BreakStopReachedOverlay once during the journey and maintains proper flow state transitions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add background sound effect during traveling phase before break point",
      "acceptanceCriteria": [
        "Sound plays automatically when travel scene begins",
        "Sound loops or plays continuously during travel",
        "Sound stops when break point is reached"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/sounds/traveling-ambient.mp3",
          "operation": "create",
          "description": "Add traveling ambient sound effect audio file (placeholder - actual audio asset to be provided). This sound will play during the traveling phase before the break point."
        },
        {
          "path": "frontend/src/components/rv/RVExperience.tsx",
          "operation": "modify",
          "description": "Add traveling ambient sound playback using the useSfx hook. Start the sound when entering traveling state, loop it during travel, and stop it when transitioning to break stop state. Ensure sound cleanup on component unmount."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add sound effect when break point is reached",
      "acceptanceCriteria": [
        "Sound plays when BreakStopReachedOverlay appears",
        "Sound is distinct from traveling sound",
        "Existing break stop sound in BreakStopReachedOverlay.tsx can be enhanced or replaced"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/sounds/break-point-reached.mp3",
          "operation": "create",
          "description": "Add break point arrival sound effect audio file (placeholder - actual audio asset to be provided). This sound will play when the break stop overlay appears."
        },
        {
          "path": "frontend/src/components/rv/BreakStopReachedOverlay.tsx",
          "operation": "modify",
          "description": "Update the existing sound effect to use the new break-point-reached.mp3 audio file. Ensure the sound plays when the overlay mounts and complements the visual break stop presentation."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add sound effect when system alert is triggered after break continue action",
      "acceptanceCriteria": [
        "Sound plays when JourneyHaltIssueOverlay appears after break continue action",
        "Sound indicates an alert or notification state",
        "Sound timing aligns with visual alert presentation"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/sounds/system-alert.mp3",
          "operation": "create",
          "description": "Add system alert sound effect audio file (placeholder - actual audio asset to be provided). This sound will play when the journey halt issue overlay appears."
        },
        {
          "path": "frontend/src/components/rv/JourneyHaltIssueOverlay.tsx",
          "operation": "modify",
          "description": "Add alert sound playback using the useSfx hook. Trigger the system-alert.mp3 sound when the overlay mounts to indicate the issue state, ensuring timing aligns with the visual alert indicators."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add sound effect when reaching final campfire destination",
      "acceptanceCriteria": [
        "Sound plays when CampfireEndScreen component is displayed",
        "Sound conveys arrival and completion",
        "Sound complements the celebratory campfire visuals"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/sounds/campfire-arrival.mp3",
          "operation": "create",
          "description": "Add campfire arrival celebration sound effect audio file (placeholder - actual audio asset to be provided). This sound will play when reaching the final destination, conveying completion and celebration."
        },
        {
          "path": "frontend/src/components/rv/CampfireEndScreen.tsx",
          "operation": "modify",
          "description": "Add campfire arrival sound playback using the useSfx hook. Trigger the campfire-arrival.mp3 sound when the component mounts to complement the celebratory visuals and convey journey completion."
        }
      ]
    }
  ]
}